apache/nuttx/arch/arm/src/stm32wb/stm32wb_mbox.c
/****************************************************************************
 * arch/arm/src/stm32wb/stm32wb_mbox.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>
#include <assert.h>
#include <nuttx/debug.h>

#include <nuttx/arch.h>
#include <nuttx/wqueue.h>

#include "arm_internal.h"
#include "stm32wb_ipcc.h"
#include "stm32wb_mbox.h"
#include "hardware/stm32wb_memorymap.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Mailbox shared buffer base address.  Normally it is located at
 * the beginning of SRAM2a.
 */

#define STM32_MBOX_SHARED_BASE      STM32_SRAM2A_BASE

/* Mailbox shared buffer fields */

#define stm32_mbox_shared \
  (*(struct stm32_mbox_shared_buffer_s *)STM32_MBOX_SHARED_BASE)

#define stm32_mbox_ref_table        (stm32_mbox_shared.ref_table)
#define stm32_mbox_di_table         (stm32_mbox_shared.dev_info_table)
#define stm32_mbox_sys_table        (stm32_mbox_shared.sys_table)
#define stm32_mbox_mm_table         (stm32_mbox_shared.mm_table)
#define stm32_mbox_ble_table        (stm32_mbox_shared.ble_table)

/* Mailbox buffer sizes */

#define STM32_MBOX_CS_BUF_SIZE      16
#define STM32_MBOX_CMDPKT_BUF_SIZE  268
#define STM32_MBOX_ACLPKT_BUF_SIZE  264

#define STM32_MBOX_RX_BUF_SIZE \
  (CONFIG_STM32WB_MBOX_RX_EVT_QUEUE_LEN * STM32_MBOX_CMDPKT_BUF_SIZE)

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* Mailbox shared buffer structures */

begin_packed_struct struct stm32_mbox_safe_boot_info_table_s
{
  uint32_t  version;
} end_packed_struct;

begin_packed_struct struct stm32_mbox_fus_info_table_s
{
  uint32_t  version;
  uint32_t  memory_size;
  uint32_t  fus_info;
} end_packed_struct;

begin_packed_struct struct stm32_mbox_wireless_fw_info_table_s
{
  uint32_t  version;
  uint32_t  memory_size;
  uint32_t  info_stack;
  uint32_t  reserved;
} end_packed_struct;

begin_packed_struct struct stm32_mbox_device_info_table_s
{
  struct stm32_mbox_safe_boot_info_table_s    safe_boot_info_table;
  struct stm32_mbox_fus_info_table_s          fus_info_table;
  struct stm32_mbox_wireless_fw_info_table_s  wireless_fw_info_table;
} end_packed_struct;

begin_packed_struct struct stm32_mbox_ble_table_s
{
  void      *cmd_buffer;
  void      *cs_buffer;
  void      *evt_queue;
  void      *acl_buffer;
} end_packed_struct;

begin_packed_struct struct stm32_mbox_sys_table_s
{
  void      *cmd_buffer;
  void      *evt_queue;
} end_packed_struct;

begin_packed_struct struct stm32_mbox_mem_manager_table_s
{
  void      *ble_spare_buffer;
  void      *sys_spare_buffer;
  void      *evtpool_buffer;
  uint32_t  evtpool_size;
  void      *evtfree_buffer;
  void      *traces_evtpool_buffer;
  uint32_t  traces_evtpool_size;
} end_packed_struct;

begin_packed_struct struct stm32_mbox_ref_table_s
{
  struct stm32_mbox_device_info_table_s   *dev_info_table;
  struct stm32_mbox_ble_table_s           *ble_table;
  void                                      *thread_table;
  struct stm32_mbox_sys_table_s           *sys_table;
  struct stm32_mbox_mem_manager_table_s   *mm_table;
  void                                      *traces_table;
  void                                      *mac_802_15_4_table;
  void                                      *zigbee_table;
  void                                      *ble_lld_test_table;
  void                                      *ble_lld_table;
} end_packed_struct;

/* Mailbox shared buffer memory layout structure */

struct stm32_mbox_shared_buffer_s
{
  aligned_data(4) struct stm32_mbox_ref_table_s         ref_table;

  aligned_data(4) struct stm32_mbox_device_info_table_s dev_info_table;
  aligned_data(4) struct stm32_mbox_ble_table_s         ble_table;
  aligned_data(4) struct stm32_mbox_sys_table_s         sys_table;
  aligned_data(4) struct stm32_mbox_mem_manager_table_s mm_table;

  aligned_data(4) stm32_mbox_list_t  evtfree_buffer;
#ifdef CONFIG_STM32WB_BLE
  aligned_data(4) stm32_mbox_list_t  ble_evt_queue;
#endif
  aligned_data(4) stm32_mbox_list_t  sys_evt_queue;

#ifdef CONFIG_STM32WB_BLE
  aligned_data(4) uint8_t ble_cs_buffer[STM32_MBOX_CS_BUF_SIZE];
#endif
  aligned_data(4) uint8_t evtpool_buffer[STM32_MBOX_RX_BUF_SIZE];
  aligned_data(4) uint8_t sys_cmd_buffer[STM32_MBOX_CMDPKT_BUF_SIZE];
  aligned_data(4) uint8_t sys_spare_buffer[STM32_MBOX_CMDPKT_BUF_SIZE];
#ifdef CONFIG_STM32WB_BLE
  aligned_data(4) uint8_t ble_spare_buffer[STM32_MBOX_CMDPKT_BUF_SIZE];
  aligned_data(4) uint8_t ble_cmd_buffer[STM32_MBOX_CMDPKT_BUF_SIZE];
  aligned_data(4) uint8_t ble_acl_buffer[STM32_MBOX_ACLPKT_BUF_SIZE];
#endif
};

/* Mailbox channel data type */

struct stm32_mbox_channel_s
{
  uint8_t                     ch_num;
  stm32_mbox_list_t         cmd_buf_queue;
  struct stm32_mbox_cmd_s   *cmd_buf;
  bool                        ack_ready;
};

/****************************************************************************
 * Private Function prototypes
 ****************************************************************************/

