apache/nuttx/arch/arm/src/stm32wb/stm32wb_mbox.c
static void stm32_ipcc_rxoisr(int irq, uint32_t *regs, void *arg);
static void stm32_ipcc_txfisr(int irq, uint32_t *regs, void *arg);

static void stm32_mbox_rxworker(void *arg);
static void stm32_mbox_txworker(void *arg);

static void stm32_mbox_eventfree(stm32_mbox_list_t *evt);
static void stm32_mbox_acksyscmd(void);

static int stm32_mbox_txdata(struct stm32_mbox_channel_s *chan,
                               uint8_t type, void *data, size_t len);
static bool stm32_mbox_txnext(struct stm32_mbox_channel_s *chan);

/****************************************************************************
 * Private Data
 ****************************************************************************/

static struct work_s g_rx_evt_work;
static struct work_s g_tx_cmd_work;

static stm32_mbox_list_t g_rx_evt_queue;
static stm32_mbox_list_t g_tx_evtfree_queue;
static uint8_t g_free_buffers[CONFIG_STM32WB_MBOX_TX_CMD_QUEUE_LEN]
                             [STM32_MBOX_CMDPKT_BUF_SIZE];
static stm32_mbox_list_t g_free_buffers_pool;

static struct stm32_mbox_channel_s g_syscmd_channel;
#ifdef CONFIG_STM32WB_BLE
static struct stm32_mbox_channel_s g_blecmd_channel;
static struct stm32_mbox_channel_s g_bleacl_channel;
#endif

static stm32_mbox_evt_handler_t receive_evt_handler;

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: stm32_ipcc_rxoisr
 *
 * Description:
 *   RX channel occupied interrupt handler (communication data posted
 *   by sending processor).
 *
 ****************************************************************************/

static void stm32_ipcc_rxoisr(int irq, uint32_t *regs, void *arg)
{
  uint32_t clrmask = 0;

  /* Pull events from system channel into processing queue */

  if (stm32_ipcc_rxactive(STM32_MBOX_SYSEVT_CHANNEL))
    {
      stm32_mbox_list_moveall(&stm32_mbox_shared.sys_evt_queue,
                                &g_rx_evt_queue);

      clrmask |= IPCC_C1SCR_CLR_BIT(STM32_MBOX_SYSEVT_CHANNEL);
    }

#ifdef CONFIG_STM32WB_BLE

  /* Pull events from BLE channel into processing queue */

  if (stm32_ipcc_rxactive(STM32_MBOX_BLEEVT_CHANNEL))
    {
      stm32_mbox_list_moveall(&stm32_mbox_shared.ble_evt_queue,
                                &g_rx_evt_queue);

      clrmask |= IPCC_C1SCR_CLR_BIT(STM32_MBOX_BLEEVT_CHANNEL);
    }
#endif

  /* Process collected events in the work queue */

  if (work_available(&g_rx_evt_work))
    {
      work_queue(HPWORK, &g_rx_evt_work, stm32_mbox_rxworker, NULL, 0);
    }

  /* Clear active statuses */

  putreg32(clrmask, STM32_IPCC_C1SCR);
}

/****************************************************************************
 * Name: stm32_ipcc_txfisr
 *
 * Description:
 *   TX channel free interrupt handler (communication data retrieved
 *   by receiving processor).
 *
 ****************************************************************************/

static void stm32_ipcc_txfisr(int irq, uint32_t *regs, void *arg)
{
  uint32_t c1mr = getreg32(STM32_IPCC_C1MR);
  uint32_t txfsrc;

  /* TXF interrupt can be triggered by not masked channels and active status
   * of the source channel is cleared by CPU2. So we ignore masked and active
   * channels and rise other C1MR bits to highlight needed channels.
   */

  txfsrc = ~(c1mr | (getreg32(STM32_IPCC_C1TOC2SR) << IPCC_C1MR_FM_SHIFT))
           & IPCC_C1MR_FM_MASK;

  /* Check if the release channel triggered the interrupt */

  if (txfsrc & IPCC_C1MR_FM_BIT(STM32_MBOX_EVT_RELEASE_CHANNEL))
    {
      /* Move all released events (if any) into transmission mailbox */

      if (!stm32_mbox_list_is_empty(&g_tx_evtfree_queue))
        {
          stm32_mbox_list_moveall(&g_tx_evtfree_queue,
                                    &stm32_mbox_shared.evtfree_buffer);

          /* Start release channel transmission */

          stm32_ipcc_settxactive(STM32_MBOX_EVT_RELEASE_CHANNEL);
        }
    }

  /* Check other channels, except the release channel */

  if (txfsrc & ~IPCC_C1MR_FM_BIT(STM32_MBOX_EVT_RELEASE_CHANNEL))
    {
      /* Check if the system channel triggered the interrupt */

      if (txfsrc & IPCC_C1MR_FM_BIT(STM32_MBOX_SYSCMD_CHANNEL))
        {
          /* System channel works in 'half-duplex' mode and acks
           * immediately on each command before TXF, so it needs
           * to process ack response before sending next command.
           */

          g_syscmd_channel.ack_ready = true;
        }

      /* Continue command processing in a work queue */

      if (work_available(&g_tx_cmd_work))
        {
          work_queue(HPWORK, &g_tx_cmd_work, stm32_mbox_txworker, NULL, 0);
        }
    }

  /* Mask triggered channels */

  putreg32(c1mr | txfsrc, STM32_IPCC_C1MR);
}

/****************************************************************************
 * Name: stm32_mbox_txworker
 ****************************************************************************/

static void stm32_mbox_txworker(void *arg)
{
  bool handled;

  /* Process all queued commands if a dedicated channel is free */

  do
    {
      handled = false;

      if (!stm32_ipcc_txactive(STM32_MBOX_SYSCMD_CHANNEL))
        {
          /* Process ack response before send new command */

          if (g_syscmd_channel.ack_ready)
            {
              stm32_mbox_acksyscmd();
              g_syscmd_channel.ack_ready = false;
            }

          handled = stm32_mbox_txnext(&g_syscmd_channel);
        }

#ifdef CONFIG_STM32WB_BLE
      if (!stm32_ipcc_txactive(STM32_MBOX_BLECMD_CHANNEL))
        {
          handled |= stm32_mbox_txnext(&g_blecmd_channel);
        }

      if (!stm32_ipcc_txactive(STM32_MBOX_BLEACL_CHANNEL))
        {
          handled |= stm32_mbox_txnext(&g_bleacl_channel);
        }
#endif
    }
  while (handled);
}

/****************************************************************************
 * Name: stm32_mbox_rxworker
 ****************************************************************************/

static void stm32_mbox_rxworker(void *arg)
{
  stm32_mbox_list_t *evt;
  irqstate_t flags;

  while (1)
    {
      flags = enter_critical_section();

