apache/nuttx/arch/arm/src/stm32wb/stm32wb_mbox.c
      /* Pull an event from the queue */

      evt = stm32_mbox_list_remove_head(&g_rx_evt_queue);

      leave_critical_section(flags);

      if (evt == NULL)
        {
          break;
        }

      /* Pass event to a callback function without a list header */

      receive_evt_handler((struct stm32_mbox_evt_s *)(evt + 1));

      /* Free completed event.  Released event needs to return to CPU2
       * via release channel.
       */

      stm32_mbox_eventfree((stm32_mbox_list_t *)evt);
    }
}

/****************************************************************************
 * Name: stm32_mbox_txdata
 *
 * Description:
 *   Send data over specified mailbox channel if possible.  If the
 *   channel is busy then add a prepared packet into awaiting queue.
 *
 ****************************************************************************/

static int stm32_mbox_txdata(struct stm32_mbox_channel_s *chan,
                               uint8_t type, void *data, size_t len)
{
  irqstate_t flags;
  struct stm32_mbox_cmd_s *pkt_buf;

  flags = enter_critical_section();

  /* To start transmission the channel needs to be free, there should be
   * none of other waiting commands and none of unprocessed ack responses.
   */

  if (stm32_mbox_list_is_empty(&chan->cmd_buf_queue) &&
      !stm32_ipcc_txactive(chan->ch_num) && !chan->ack_ready)
    {
      /* Channel is ready, copy command into transmission buffer */

      pkt_buf = chan->cmd_buf;
    }
  else
    {
      /* Otherwise get temp buffer for command */

      pkt_buf = (struct stm32_mbox_cmd_s *)
                stm32_mbox_list_remove_head(&g_free_buffers_pool);
    }

  leave_critical_section(flags);

  if (pkt_buf == NULL)
    {
      return -ENOBUFS;
    }

  pkt_buf->type = type;
  memcpy(&pkt_buf->cmd_hdr, data, len);

  if (pkt_buf == chan->cmd_buf)
    {
      /* Command is ready in mailbox buffer, start transmission now */

      stm32_ipcc_settxactive(chan->ch_num);

      if (!stm32_mbox_list_is_empty(&chan->cmd_buf_queue) ||
          chan->ch_num == STM32_MBOX_SYSCMD_CHANNEL)
        {
          /* There are more commands awaiting, so unmask interrupt to get
           * notified when channel gets ready to process a next one.
           * And the system channel needs to check ack on completion.
           */

          stm32_ipcc_unmasktxf(chan->ch_num);
        }
    }
  else
    {
      /* Command is in temp buffer, push it into queue */

      flags = enter_critical_section();
      stm32_mbox_list_add_tail(&chan->cmd_buf_queue, &pkt_buf->list_hdr);
      leave_critical_section(flags);

      /* Unmask interrupt to get notified when channel gets free */

      stm32_ipcc_unmasktxf(chan->ch_num);
    }

  return OK;
}

/****************************************************************************
 * Name: stm32_mbox_txnext
 *
 * Description:
 *   Send next command from the queue.
 *
 ****************************************************************************/

static bool stm32_mbox_txnext(struct stm32_mbox_channel_s *chan)
{
  struct stm32_mbox_cmd_s *pkt_buf;

  pkt_buf = (struct stm32_mbox_cmd_s *)
            stm32_mbox_list_remove_head(&chan->cmd_buf_queue);

  if (pkt_buf != NULL)
    {
      chan->cmd_buf->type = pkt_buf->type;

      if (chan->ch_num == STM32_MBOX_BLEACL_CHANNEL)
        {
          memcpy(&chan->cmd_buf->acl_hdr, &pkt_buf->acl_hdr,
                 sizeof(pkt_buf->acl_hdr) + pkt_buf->acl_hdr.len);
        }
      else
        {
          memcpy(&chan->cmd_buf->cmd_hdr, &pkt_buf->cmd_hdr,
                 sizeof(pkt_buf->cmd_hdr) + pkt_buf->cmd_hdr.param_len);
        }

      /* Start transmission */

      stm32_ipcc_settxactive(chan->ch_num);

      if (!stm32_mbox_list_is_empty(&chan->cmd_buf_queue))
        {
          /* Unmask TXF interrupt to get notified when completed */

          stm32_ipcc_unmasktxf(chan->ch_num);
        }

      /* Put back to pool the freed command buffer */

      stm32_mbox_list_add_tail(&g_free_buffers_pool, &pkt_buf->list_hdr);
    }

  return pkt_buf != NULL;
}

/****************************************************************************
 * Name: stm32_mbox_eventfree
 *
 * Description:
 *   Free handled mailbox event.
 *
 ****************************************************************************/

static void stm32_mbox_eventfree(stm32_mbox_list_t *evt)
{
  irqstate_t flags;

  flags = enter_critical_section();

  /* Collect releasing events in the global list */

  stm32_mbox_list_add_tail(&g_tx_evtfree_queue, evt);

  /* Check if release channel is ready to process now */

  if (!stm32_ipcc_txactive(STM32_MBOX_EVT_RELEASE_CHANNEL))
    {
      /* Move all collected events into transmission queue */

      stm32_mbox_list_moveall(&g_tx_evtfree_queue,
                                &stm32_mbox_shared.evtfree_buffer);

      /* Start transmission */

      stm32_ipcc_settxactive(STM32_MBOX_EVT_RELEASE_CHANNEL);
    }
  else
    {
      /* Unmask interrupt to get notified when channel gets free */

      stm32_ipcc_unmasktxf(STM32_MBOX_EVT_RELEASE_CHANNEL);
    }

  leave_critical_section(flags);
}

/****************************************************************************
 * Name: stm32_mbox_acksyscmd
 *
 * Description:
 *   Send ACK response event for completed system command.
 *
 ****************************************************************************/

static void stm32_mbox_acksyscmd(void)
{
  struct stm32_mbox_evt_s *evt;

  /* System command ACK response is placed at the same address as the
   * processed command but without a list header.
   */

  evt = (struct stm32_mbox_evt_s *)(&g_syscmd_channel.cmd_buf);
  evt->type = STM32_MBOX_SYSACK;

  receive_evt_handler(evt);
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: stm32_mboxinitialize
 *
 * Description:
 *   Initialize mailbox driver memory.
 *
 * Input Parameters:
 *   evt_handler - the function to call on event receive
 *
 ****************************************************************************/

void stm32_mboxinitialize(stm32_mbox_evt_handler_t evt_handler)
{
  int i;

  /* Init mailbox shared data */

  stm32_mbox_list_initialize(&stm32_mbox_shared.sys_evt_queue);
  stm32_mbox_list_initialize(&stm32_mbox_shared.evtfree_buffer);
#ifdef CONFIG_STM32WB_BLE
  stm32_mbox_list_initialize(&stm32_mbox_shared.ble_evt_queue);
#endif

  stm32_mbox_ref_table.dev_info_table = &stm32_mbox_di_table;
  stm32_mbox_ref_table.ble_table      = &stm32_mbox_ble_table;
  stm32_mbox_ref_table.sys_table      = &stm32_mbox_sys_table;
  stm32_mbox_ref_table.mm_table       = &stm32_mbox_mm_table;

