apache/nuttx/arch/arm/src/stm32wb/stm32wb_mbox.c
  stm32_mbox_sys_table.cmd_buffer = &stm32_mbox_shared.sys_cmd_buffer;
  stm32_mbox_sys_table.evt_queue  = &stm32_mbox_shared.sys_evt_queue;

  stm32_mbox_mm_table.evtpool_buffer   = &stm32_mbox_shared
                                            .evtpool_buffer;
  stm32_mbox_mm_table.evtpool_size     = sizeof(stm32_mbox_shared
                                                  .evtpool_buffer);
  stm32_mbox_mm_table.evtfree_buffer   = &stm32_mbox_shared
                                            .evtfree_buffer;
  stm32_mbox_mm_table.sys_spare_buffer = &stm32_mbox_shared
                                            .sys_spare_buffer;
#ifdef CONFIG_STM32WB_BLE
  stm32_mbox_mm_table.ble_spare_buffer = &stm32_mbox_shared
                                            .ble_spare_buffer;
#endif

#ifdef CONFIG_STM32WB_BLE
  stm32_mbox_ble_table.cmd_buffer = &stm32_mbox_shared.ble_cmd_buffer;
  stm32_mbox_ble_table.acl_buffer = &stm32_mbox_shared.ble_acl_buffer;
  stm32_mbox_ble_table.cs_buffer  = &stm32_mbox_shared.ble_cs_buffer;
  stm32_mbox_ble_table.evt_queue  = &stm32_mbox_shared.ble_evt_queue;
#endif

  /* Init system channel data */

  g_syscmd_channel.ch_num =  STM32_MBOX_SYSCMD_CHANNEL;
  g_syscmd_channel.cmd_buf = (struct stm32_mbox_cmd_s *)
                              stm32_mbox_shared.sys_cmd_buffer;
  stm32_mbox_list_initialize(&g_syscmd_channel.cmd_buf_queue);

#ifdef CONFIG_STM32WB_BLE
  /* Init BLE command channel data */

  g_blecmd_channel.ch_num =  STM32_MBOX_BLECMD_CHANNEL;
  g_blecmd_channel.cmd_buf = (struct stm32_mbox_cmd_s *)
                             stm32_mbox_shared.ble_cmd_buffer;
  stm32_mbox_list_initialize(&g_blecmd_channel.cmd_buf_queue);

  /* Init BLE ACL channel data */

  g_bleacl_channel.ch_num =  STM32_MBOX_BLEACL_CHANNEL;
  g_bleacl_channel.cmd_buf = (struct stm32_mbox_cmd_s *)
                             stm32_mbox_shared.ble_acl_buffer;
  stm32_mbox_list_initialize(&g_bleacl_channel.cmd_buf_queue);
#endif

  /* Init local (not shared) queues */

  stm32_mbox_list_initialize(&g_rx_evt_queue);
  stm32_mbox_list_initialize(&g_tx_evtfree_queue);

  stm32_mbox_list_initialize(&g_free_buffers_pool);
  for (i = 0; i < CONFIG_STM32WB_MBOX_TX_CMD_QUEUE_LEN; i++)
    {
      stm32_mbox_list_add_tail(&g_free_buffers_pool,
                                 (stm32_mbox_list_t *)g_free_buffers[i]);
    }

  /* Set event receive function */

  receive_evt_handler = evt_handler;
}

/****************************************************************************
 * Name: stm32_mboxenable
 *
 * Description:
 *   Enable mailbox hardware and start communication.  The CPU2 responses
 *   with C2Ready event on success.
 *
 ****************************************************************************/

void stm32_mboxenable(void)
{
  uint32_t regval;

  /* Setup RXO and TXF interrupts */

  irq_attach(STM32_IRQ_IPCCRX, (xcpt_t)stm32_ipcc_rxoisr, NULL);
  up_enable_irq(STM32_IRQ_IPCCRX);

  irq_attach(STM32_IRQ_IPCCTX, (xcpt_t)stm32_ipcc_txfisr, NULL);
  up_enable_irq(STM32_IRQ_IPCCTX);

  regval = getreg32(STM32_IPCC_C1CR);
  regval |= IPCC_C1CR_RXOIE | IPCC_C1CR_TXFIE;
  putreg32(regval, STM32_IPCC_C1CR);

  /* Unmask system channel RXO interrupt.  Once CPU2 started we expect
   * to receive C2READY event via system channel.
   */

  stm32_ipcc_unmaskrxo(STM32_MBOX_SYSEVT_CHANNEL);

  /* Enable IPCC hardware and boot up CPU2 */

  stm32_ipccenable();
}

/****************************************************************************
 * Name: stm32_mbox_syscmd
 *
 * Description:
 *   Send command over mailbox system channel.  Command data must be
 *   prepended with HCI header.
 *
 ****************************************************************************/

int stm32_mbox_syscmd(void *data, size_t len)
{
  return stm32_mbox_txdata(&g_syscmd_channel, STM32_MBOX_SYSCMD,
                             data, len);
}

#ifdef CONFIG_STM32WB_BLE
/****************************************************************************
 * Name: stm32_mbox_blecmd
 *
 * Description:
 *   Send command over mailbox BLE channel.  Command data must be
 *   prepended with HCI header.
 *
 ****************************************************************************/

int stm32_mbox_blecmd(void *data, size_t len)
{
  return stm32_mbox_txdata(&g_blecmd_channel, STM32_MBOX_HCICMD,
                             data, len);
}

/****************************************************************************
 * Name: stm32_mbox_bleacl
 *
 * Description:
 *   Send BLE ACL data over mailbox BLE ACL channel.  Data must be
 *   prepended with HCI ACL header.
 *
 ****************************************************************************/

int stm32_mbox_bleacl(void *data, size_t len)
{
  return stm32_mbox_txdata(&g_bleacl_channel, STM32_MBOX_HCIACL,
                             data, len);
}

/****************************************************************************
 * Name: stm32_mbox_bleinit
 *
 * Description:
 *   Initialize and start BLE subsystem with provided configuration params.
 *
 ****************************************************************************/

void stm32_mbox_bleinit(struct stm32_shci_ble_init_cfg_s *params)
{
  struct bt_hci_cmd_hdr_s *cmd;

  /* Just borrow a temporary free buffer for command data */

  cmd = (struct bt_hci_cmd_hdr_s *)stm32_mbox_shared.sys_spare_buffer;

  /* Prepare command data */

  cmd->opcode = STM32_SHCI_BLE_INIT;
  cmd->param_len = sizeof(*cmd);
  memcpy(cmd + 1, params, sizeof(*params));

  /* Send BLE init command to CPU2 */

  stm32_mbox_syscmd(cmd, sizeof(*cmd) + sizeof(*params));

  /* Unmask BLE event channel RXO interrupt */

  stm32_ipcc_unmaskrxo(STM32_MBOX_BLEEVT_CHANNEL);
}
#endif /* CONFIG_STM32WB_BLE */
